Revit 2021.1 API
DGNExportOptions Properties
The DGNExportOptions type exposes the following members.
Properties
Name | Description
Colors
 Export color mode. Default value is ExportColorMode.IndexColors.
 (Inherited from BaseExportOptions.)
FileVersion
 The DGN file version. Default value of fileVersion is DGNFileFormat.Default.
HatchPatternsFileName
 Custom hatch patterns (pat) file name.
 (Inherited from BaseExportOptions.)
HideReferencePlane
 Whether or not to hide reference planes. Default value is false.
 (Inherited from BaseExportOptions.)
HideScopeBox
 Whether or not to hide the scope box. Default value is false.
 (Inherited from BaseExportOptions.)
HideUnreferenceViewTags
 Whether or not to hide unreference view tags. Default value is false.
 (Inherited from BaseExportOptions.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from BaseExportOptions.)
LayerMapping
 Name of a layer settings standard or filename (with custom layer settings). Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567. default value is "" (empty) which means if no value is set, if no value is set, Revit will use a default value according to the localization.
 (Inherited from BaseExportOptions.)
MasterUnits |  Obsolete.
 The master units. Default value of masterUnits is true.
MergedViews
 Whether to merge all views in one file (via XRefs). Default value of mergedViews is false.
PreserveCoincidentLines
 Whether or not to preserve coincident lines. Default value is false.
 (Inherited from BaseExportOptions.)
PropOverrides
 How to export overridden object styles. Default value is PropOverrideMode.ByEntity.
 (Inherited from BaseExportOptions.)
SeedName
 The name of the DGN seed. Default value of seedName is empty.
WorkingUnits
 If true, Master Units will be used. If false, Sub Units will be used. Default value of WorkingUnits is true.
See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace